openfoam/run/Airfoil2D_full/0/U
/*--------------------------------*- C++ -*----------------------------------*\n| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  5                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.013400405734332821 0.003656975121811262 0);

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform (0.013400405734332821 0.003656975121811262 0);
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform (0.013400405734332821 0.003656975121811262 0);
    }

    walls
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
