openfoam/run/Airfoil2D_full/0/grad(U)
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      grad(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<tensor> 
11040
(
(-3233.67 -410.867 0 641.128 81.4609 0 0 0 0)
(-2888.61 -367.024 0 2166.44 275.265 0 -1.96799e-15 -2.50051e-16 0)
(-2472.14 -314.108 0 3021.54 383.913 0 0 0 0)
(-2105.56 -267.531 0 3448.94 438.218 0 0 0 0)
(-1803.54 -229.156 0 3662.54 465.358 0 0 0 0)
(-1557.63 -197.91 0 3770.04 479.017 0 -3.66857e-15 -4.66124e-16 0)
(-1354.94 -172.157 0 3825.49 486.062 0 3.62606e-15 4.60723e-16 0)
(-1184.39 -150.488 0 3855.58 489.885 0 -1.87784e-16 -2.38596e-17 0)
...
)
;

boundaryField
{
    inlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
230
(
(0 0 0 0 0 0 0 0 0)
(5.38686e-14 0 0 0 0 0 0 0 0)
(0 -6.42794e-15 0 0 0 0 2.5011e-18 3.17787e-19 0)
(0 6.13666e-15 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(-4.47564e-14 -1.11891e-14 0 0 0 0 4.35367e-18 5.53172e-19 0)
(4.27397e-14 5.34246e-15 0 0 0 0 0 0 0)
(-4.08179e-14 0 0 0 0 0 0 0 0)
...
)
;
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
96
(
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 -5.77025e-13 -7.33161e-14 0)
(0 0 0 0 0 0 5.43937e-13 6.9112e-14 0)
(0 0 0 0 0 0 -2.56263e-13 -3.25605e-14 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 -2.27175e-13 -2.88646e-14 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 2.00879e-13 2.55235e-14 0)
...
)
;
    }
    walls
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
82
(
(-6567.88 -834.508 0 1302.19 165.454 0 0 0 0)
(-5859.03 -744.442 0 4394.23 558.325 0 -6.01545e-15 -7.64316e-16 0)
(-5009.39 -636.487 0 6122.64 777.935 0 0 0 0)
(-4260 -541.27 0 6977.92 886.606 0 3.97558e-15 5.05132e-16 0)
(-3643.4 -462.926 0 7398.84 940.087 0 3.75552e-15 4.77173e-16 0)
(-3142.22 -399.247 0 7605.34 966.326 0 -3.66857e-15 -4.66124e-16 0)
(-2729.97 -346.867 0 7707.7 979.332 0 3.55103e-16 4.5119e-17 0)
(-2383.83 -302.886 0 7760.12 985.991 0 -3.23048e-15 -4.10461e-16 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
