openfoam/run/Airfoil2D_full/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
204
(
(-0.00515908 -0.00102008 9.69334e-27)
(-0.00512307 -0.00102541 -9.13925e-27)
(-0.00508272 -0.000993653 -3.81977e-23)
(-0.00500549 -0.000903368 -8.26602e-23)
(-0.00484559 -0.000710912 -4.85372e-22)
(-0.0047357 -0.000599605 1.60115e-22)
(-0.00467381 -0.000585169 1.44603e-22)
(-0.00461417 -0.000570755 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
