openfoam/run/Airfoil2D_full/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          574;
        startFace       215247;
    }
    outlet
    {
        type            patch;
        nFaces          376;
        startFace       215821;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          204;
        startFace       216197;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          215824;
        startFace       216401;
    }
)

// ************************************************************************* //
