openfoam/run/Airfoil2D_full/system/blockMeshDict

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object blockMeshDict;
}
convertToMeters 1;

geometry
{
}

vertices
( ( 0      0      0)
 ( 1      0      0)
 ( 1     12      0)
 ( -11    0       0)
 ( 0     0      0.3)
 ( 1     0      0.3)
 ( 1    12      0.3)
 ( -11     0      0.3)
 ( 21    0      0)
 ( 21    12      0)
 ( 21    0     0.3)
 ( 21    12     0.3)
 ( 1    -12     0)
 ( 1    -12     0.3)
 ( 21    -12      0)
 ( 21    -12     0.3)
 (  1     0      0)
 (  1     0     0.3)
);
blocks
(
 hex (0 1 2 3 4 5 6 7) (102 188 1)
 edgeGrading
 (
     (
         ( 0.4 0.512195 3.5 )
         ( 0.6 0.487805 1.16667 )
     )
         0.03 0.03
     (
         ( 0.4 0.512195 3.5 )
         ( 0.6 0.487805 1.16667 )
     )
     (
         ( 0.00833333 0.333333 95.3962 )
         ( 0.991667 0.666667 52.413 )
     )
     (
         ( 0.00833333 0.333333 95.3962 )
         ( 0.991667 0.666667 52.413 )
     )
     (
         ( 0.00833333 0.333333 95.3962 )
         ( 0.991667 0.666667 52.413 )
     )
     (
         ( 0.00833333 0.333333 95.3962 )
         ( 0.991667 0.666667 52.413 )
     )
     1  1  1  1 )
 hex ( 1 8 9 2 5 10 11 6 ) ( 185 188 1 )
 edgeGrading
 (
 33.3333 33.3333 33.3333 33.3333      (
         ( 0.00833333 0.333333 95.3962 )
         ( 0.991667 0.666667 52.413 )
     )
 78.6195 78.6195 
     (
         ( 0.00833333 0.333333 95.3962 )
         ( 0.991667 0.666667 52.413 )
     )
 1 1 1 1 
 )
 hex (3 12 16 0 7 13 17 4) (102 188 1)
 edgeGrading
 (
 0.03      (
         ( 0.4 0.512195 3.5 )
         ( 0.6 0.487805 1.16667 )
     )
     (
         ( 0.4 0.512195 3.5 )
         ( 0.6 0.487805 1.16667 )
     )
 0.03      (
         ( 0.991667 0.666667 0.0190792 )
         ( 0.00833333 0.333333 0.0104826 )
     )
     (
         ( 0.991667 0.666667 0.0190792 )
         ( 0.00833333 0.333333 0.0104826 )
     )
     (
         ( 0.991667 0.666667 0.0190792 )
         ( 0.00833333 0.333333 0.0104826 )
     )
     (
         ( 0.991667 0.666667 0.0190792 )
         ( 0.00833333 0.333333 0.0104826 )
     )
  1 1 1 1 
 )

 hex ( 12 14 8 16 13 15 10 17 ) ( 185 188 1 ) 
 edgeGrading
 (
 33.3333 33.3333 33.3333 33.3333 
     (
         ( 0.991667 0.666667 0.0190792 )
         ( 0.00833333 0.333333 0.0104826 )
     )
 0.0127195 0.0127195 
     (
         ( 0.991667 0.666667 0.0190792 )
         ( 0.00833333 0.333333 0.0104826 )
     )
  1 1 1 1 
 )
);

edges
(
 arc 3 2 ( -7.48528 8.48528 0 )
 arc 7 6 ( -7.48528 8.48528 0.3 )
 spline 1 0 
 (
     ( 1 -2.47609e-17 0 ) 
     ( 0.999042 0.000344537 0 ) 
     ( 0.99617 0.00137394 0 ) 
     ( 0.991394 0.00307565 0 ) 
     ( 0.984728 0.00542907 0 ) 
     ( 0.976195 0.00840597 0 ) 
     ( 0.96582 0.0119711 0 ) 
     ( 0.95364 0.0160828 0 ) 
     ( 0.939693 0.0206939 0 ) 
     ( 0.924026 0.0257527 0 ) 
     ( 0.906693 0.0312034 0 ) 
     ( 0.887753 0.0369872 0 ) 
     ( 0.867273 0.0430433 0 ) 
     ( 0.845325 0.0493092 0 ) 
     ( 0.821987 0.0557217 0 ) 
     ( 0.797346 0.0622171 0 ) 
     ( 0.771492 0.0687318 0 ) 
     ( 0.744521 0.0752028 0 ) 
     ( 0.716536 0.0815678 0 ) 
     ( 0.687643 0.0877652 0 ) 
     ( 0.657955 0.0937347 0 ) 
     ( 0.627586 0.0994175 0 ) 
     ( 0.596657 0.104756 0 ) 
     ( 0.565292 0.109695 0 ) 
     ( 0.533617 0.11418 0 ) 
     ( 0.501762 0.118162 0 ) 
     ( 0.469857 0.121592 0 ) 
     ( 0.438035 0.124427 0 ) 
     ( 0.406431 0.126628 0 ) 
     ( 0.374581 0.128073 0 ) 
     ( 0.343058 0.128559 0 ) 
     ( 0.312162 0.128075 0 ) 
     ( 0.282041 0.126628 0 ) 
     ( 0.25284 0.124238 0 ) 
     ( 0.2247 0.120936 0 ) 
     ( 0.197754 0.116765 0 ) 
     ( 0.172131 0.11178 0 ) 
     ( 0.147948 0.106046 0 ) 
     ( 0.125317 0.0996337 0 ) 
     ( 0.104336 0.0926251 0 ) 
     ( 0.0850946 0.0851049 0 ) 
     ( 0.0676703 0.0771618 0 ) 
     ( 0.0521295 0.0688852 0 ) 
     ( 0.0385273 0.0603634 0 ) 
     ( 0.0269078 0.0516812 0 ) 
     ( 0.0173042 0.0429175 0 ) 
     ( 0.00973967 0.0341436 0 ) 
     ( 0.00422732 0.025421 0 ) 
     ( 0.00077117 0.0167999 0 ) 
 )

 spline 5 4 
 (
     ( 1 -2.47609e-17 0.3 ) 
     ( 0.999042 0.000344537 0.3 ) 
     ( 0.99617 0.00137394 0.3 ) 
     ( 0.991394 0.00307565 0.3 ) 
     ( 0.984728 0.00542907 0.3 ) 
     ( 0.976195 0.00840597 0.3 ) 
     ( 0.96582 0.0119711 0.3 ) 
     ( 0.95364 0.0160828 0.3 ) 
     ( 0.939693 0.0206939 0.3 ) 
     ( 0.924026 0.0257527 0.3 ) 
     ( 0.906693 0.0312034 0.3 ) 
     ( 0.887753 0.0369872 0.3 ) 
     ( 0.867273 0.0430433 0.3 ) 
     ( 0.845325 0.0493092 0.3 ) 
     ( 0.821987 0.0557217 0.3 ) 
     ( 0.797346 0.0622171 0.3 ) 
     ( 0.771492 0.0687318 0.3 ) 
     ( 0.744521 0.0752028 0.3 ) 
     ( 0.716536 0.0815678 0.3 ) 
     ( 0.687643 0.0877652 0.3 ) 
     ( 0.657955 0.0937347 0.3 ) 
     ( 0.627586 0.0994175 0.3 ) 
     ( 0.596657 0.104756 0.3 ) 
     ( 0.565292 0.109695 0.3 ) 
     ( 0.533617 0.11418 0.3 ) 
     ( 0.501762 0.118162 0.3 ) 
     ( 0.469857 0.121592 0.3 ) 
     ( 0.438035 0.124427 0.3 ) 
     ( 0.406431 0.126628 0.3 ) 
     ( 0.374581 0.128073 0.3 ) 
     ( 0.343058 0.128559 0.3 ) 
     ( 0.312162 0.128075 0.3 ) 
     ( 0.282041 0.126628 0.3 ) 
     ( 0.25284 0.124238 0.3 ) 
     ( 0.2247 0.120936 0.3 ) 
     ( 0.197754 0.116765 0.3 ) 
     ( 0.172131 0.11178 0.3 ) 
     ( 0.147948 0.106046 0.3 ) 
     ( 0.125317 0.0996337 0.3 ) 
     ( 0.104336 0.0926251 0.3 ) 
     ( 0.0850946 0.0851049 0.3 ) 
     ( 0.0676703 0.0771618 0.3 ) 
     ( 0.0521295 0.0688852 0.3 ) 
     ( 0.0385273 0.0603634 0.3 ) 
     ( 0.0269078 0.0516812 0.3 ) 
     ( 0.0173042 0.0429175 0.3 ) 
     ( 0.00973967 0.0341436 0.3 ) 
     ( 0.00422732 0.025421 0.3 ) 
     ( 0.00077117 0.0167999 0.3 ) 
 )

 arc 3 12 ( -7.48528 -8.48528 0 ) 
 arc 7 13 ( -7.48528 -8.48528 0.3 ) 

 spline 0 16 
 (
     ( 0 0 0 ) 
     ( 0.00260684 -0.00792395 0 ) 
     ( 0.00711413 -0.0152306 0 ) 
     ( 0.0134854 -0.0219177 0 ) 
     ( 0.0216772 -0.0279836 0 ) 
     ( 0.0316392 -0.0334283 0 ) 
     ( 0.0433157 -0.0382529 0 ) 
     ( 0.0566457 -0.0424611 0 ) 
     ( 0.0715639 -0.046059 0 ) 
     ( 0.0880018 -0.0490566 0 ) 
     ( 0.105888 -0.0514676 0 ) 
     ( 0.125151 -0.0533108 0 ) 
     ( 0.145714 -0.0546097 0 ) 
     ( 0.167505 -0.0553938 0 ) 
     ( 0.190445 -0.0556978 0 ) 
     ( 0.214461 -0.0555624 0 ) 
     ( 0.239473 -0.0550333 0 ) 
     ( 0.265406 -0.0541611 0 ) 
     ( 0.29218 -0.0530003 0 ) 
     ( 0.319714 -0.0516084 0 ) 
     ( 0.347925 -0.0500448 0 ) 
     ( 0.376729 -0.0483695 0 ) 
     ( 0.406188 -0.0466364 0 ) 
     ( 0.436632 -0.0447364 0 ) 
     ( 0.467353 -0.0426376 0 ) 
     ( 0.498238 -0.0403838 0 ) 
     ( 0.529173 -0.0380167 0 ) 
     ( 0.560041 -0.0355747 0 ) 
     ( 0.590724 -0.0330929 0 ) 
     ( 0.621104 -0.0306021 0 ) 
     ( 0.651062 -0.0281291 0 ) 
     ( 0.680481 -0.0256966 0 ) 
     ( 0.709243 -0.0233233 0 ) 
     ( 0.737232 -0.0210244 0 ) 
     ( 0.764335 -0.0188119 0 ) 
     ( 0.790439 -0.0166952 0 ) 
     ( 0.815437 -0.0146816 0 ) 
     ( 0.839223 -0.0127772 0 ) 
     ( 0.861696 -0.0109868 0 ) 
     ( 0.88276 -0.00931477 0 ) 
     ( 0.902324 -0.00776533 0 ) 
     ( 0.920302 -0.00634275 0 ) 
     ( 0.936614 -0.0050515 0 ) 
     ( 0.951187 -0.00389627 0 ) 
     ( 0.963956 -0.0028819 0 ) 
     ( 0.974862 -0.00201325 0 ) 
     ( 0.983855 -0.00129499 0 ) 
     ( 0.990894 -0.000731379 0 ) 
     ( 0.995945 -0.000326017 0 ) 
 )

 spline 4 17 
 (
     ( 0 0 0.3 ) 
     ( 0.00260684 -0.00792395 0.3 ) 
     ( 0.00711413 -0.0152306 0.3 ) 
     ( 0.0134854 -0.0219177 0.3 ) 
     ( 0.0216772 -0.0279836 0.3 ) 
     ( 0.0316392 -0.0334283 0.3 ) 
     ( 0.0433157 -0.0382529 0.3 ) 
     ( 0.0566457 -0.0424611 0.3 ) 
     ( 0.0715639 -0.046059 0.3 ) 
     ( 0.0880018 -0.0490566 0.3 ) 
     ( 0.105888 -0.0514676 0.3 ) 
     ( 0.125151 -0.0533108 0.3 ) 
     ( 0.145714 -0.0546097 0.3 ) 
     ( 0.167505 -0.0553938 0.3 ) 
     ( 0.190445 -0.0556978 0.3 ) 
     ( 0.214461 -0.0555624 0.3 ) 
     ( 0.239473 -0.0550333 0.3 ) 
     ( 0.265406 -0.0541611 0.3 ) 
     ( 0.29218 -0.0530003 0.3 ) 
     ( 0.319714 -0.0516084 0.3 ) 
     ( 0.347925 -0.0500448 0.3 ) 
     ( 0.376729 -0.0483695 0.3 ) 
     ( 0.406188 -0.0466364 0.3 ) 
     ( 0.436632 -0.0447364 0.3 ) 
     ( 0.467353 -0.0426376 0.3 ) 
     ( 0.498238 -0.0403838 0.3 ) 
     ( 0.529173 -0.0380167 0.3 ) 
     ( 0.560041 -0.0355747 0.3 ) 
     ( 0.590724 -0.0330929 0.3 ) 
     ( 0.621104 -0.0306021 0.3 ) 
     ( 0.651062 -0.0281291 0.3 ) 
     ( 0.680481 -0.0256966 0.3 ) 
     ( 0.709243 -0.0233233 0.3 ) 
     ( 0.737232 -0.0210244 0.3 ) 
     ( 0.764335 -0.0188119 0.3 ) 
     ( 0.790439 -0.0166952 0.3 ) 
     ( 0.815437 -0.0146816 0.3 ) 
     ( 0.839223 -0.0127772 0.3 ) 
     ( 0.861696 -0.0109868 0.3 ) 
     ( 0.88276 -0.00931477 0.3 ) 
     ( 0.902324 -0.00776533 0.3 ) 
     ( 0.920302 -0.00634275 0.3 ) 
     ( 0.936614 -0.0050515 0.3 ) 
     ( 0.951187 -0.00389627 0.3 ) 
     ( 0.963956 -0.0028819 0.3 ) 
     ( 0.974862 -0.00201325 0.3 ) 
     ( 0.983855 -0.00129499 0.3 ) 
     ( 0.990894 -0.000731379 0.3 ) 
     ( 0.995945 -0.000326017 0.3 ) 
 )

);

faces
(
);

faces
(
);

defaultPatch
{
 name frontAndBack;
 type empty;
}

boundary
(
inlet
 {
     type patch; 
     faces 
     ( 
         ( 9 2 6 11 ) 
         ( 2 3 7 6 ) 
         ( 3 12 13 7 ) 
         ( 12 15 14 13 ) 
     ); 
 }

outlet
 {
     type patch; 
     faces 
     (
         ( 8 9 10 11 ) 
         ( 15 8 10 14 ) 
     );
 }

walls
 {
     type wall;
     faces
     (
         ( 0 1 5 4 )
         ( 0 4 17 16 )
     );
 }

interface1
 {
     type patch;
     faces
     (
         ( 1 8 10 5 )
     );
 }
interface2
 {
     type patch;
     faces
     (
         ( 16 17 10 8 )
     );
 }
);
mergePatchPairs
(
 ( interface1 interface2 )
);
