openfoam/run/Airfoil2D_full/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3500; // must be high enough to assure convergence, about 10000;

deltaT          1;

writeControl    timeStep;

writeInterval   500;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
	forces
	{
		type forces;
		functionObjectLibs ("libforces.so"); //Lib to load
		patches (walls); // change to your patch name
		rho rhoInf;
		rhoInf 1.0; //Reference density for fluid
		CofR (0.5 0 0); //Origin for moment calculations
	}
	forceCoeffs
	{
		type forceCoeffs;
		libs ("libforces.so");
		writeControl timeStep;
		writeInterval 500;
		log true;
		patches (walls);
		rho rhoInf;
		rhoInf 1.0;
		liftDir (-0.25 0.966 0);
		dragDir (0.966 0.25 0);
		CofR (0.5 0 0);
		pitchAxis (0 0 1);
		magUInf 80;
		lRef 1.0;
		Aref 0.3;	
	}
}

// ************************************************************************* //
